backend/controllers/CostrelationController.php

SELECT EXISTS(SELECT * FROM `community_realestate` WHERE `community_realestate`.`realestate_id`='3673')
SELECT EXISTS(SELECT * FROM `community_basic` WHERE `community_basic`.`community_id`='22')
SELECT EXISTS(SELECT * FROM `community_building` WHERE `community_building`.`building_id`='44')
---
	public function actionCreate1($id)
	{
		$model = new CostRelation();

		$c = $_SESSION['user']['community'];
	    $array = Yii::$app->db->createCommand('select cost_id,cost_name from cost_name where level = 0')->queryAll();
	    $cost = ArrayHelper::map($array,'cost_id','cost_name');

		//获取小区和楼宇编号
		$r_info = CommunityRealestate::find()
			->select('community_id,building_id')
			->where(['realestate_id' => $id])
			->asArray()
			->one();
		//获取小区名称
		$c_info = CommunityBasic::find()
			->select('community_name,community_id')
			->where(['community_id' => $r_info['community_id']])
			->asArray()
			->all();
		//获取楼宇名称
		$b_info = CommunityBuilding::find()
			->select('building_name,building_id')
			->where(['building_id' => $r_info['building_id']])
			->asArray()
			->all();