backend/controllers/CostNameController.php

SELECT * FROM `cost_name` WHERE `cost_id`='40'
---
    protected function findModel($id)
    {
        if (($model = CostName::findOne($id)) !== null) {