backend/controllers/UserInvoiceController.php

SELECT `community_realestate`.`community_id`, `community_basic`.`community_name`, `community_realestate`.`building_id`, `community_building`.`building_name`, `community_realestate`.`acreage`, `community_realestate`.`room_name`, `community_realestate`.`room_number`, `cost_relation`.`realestate_id`, `cost_relation`.`cost_id`, `cost_name`.`cost_name`, `cost_name`.`parent`, `cost_name`.`price` FROM `cost_relation` left join `community_realestate` ON cost_relation.realestate_id = community_realestate.realestate_id left join `community_building` ON community_building.building_id = community_realestate.building_id left join `community_basic` ON community_basic.community_id = community_realestate.community_id left join `cost_name` ON cost_relation.cost_id = cost_name.cost_id WHERE (`community_realestate`.`community_id` IS NULL) AND (`cost_name`.`cost_name` NOT LIKE '%水费%') LIMIT 20
---
	public function actionNew()
	{
		if($_SESSION[ 'user' ][ 'name' ] == 'admin'){
			$query = ( new\ yii\ db\ Query() )->select( [
			'community_realestate.community_id',
			'community_basic.community_name',
			'community_realestate.building_id',
			'community_building.building_name',
			'community_realestate.acreage',
			'community_realestate.room_name',
			'community_realestate.room_number',
			'cost_relation.realestate_id',
			'cost_relation.cost_id',
			'cost_name.cost_name',
			'cost_name.parent',
			'cost_name.price',
		] )->from( 'cost_relation' )
			->join( 'left join', 'community_realestate', 'cost_relation.realestate_id = community_realestate.realestate_id' )
			->join( 'left join', 'community_building', 'community_building.building_id = community_realestate.building_id' )
			->join( 'left join', 'community_basic', 'community_basic.community_id = community_realestate.community_id' )
			->join( 'left join', 'cost_name', 'cost_relation.cost_id = cost_name.cost_id' )
			->where(['or not like','cost_name.cost_name',['水费']]) // 去除水费
			//->where( [ 'community_realestate.community_id' => $_SESSION[ 'user' ][ 'community' ] ] )
		    ->limit( 20 )
		    ->all();
		}else{
			$query = ( new\ yii\ db\ Query() )->select( [
			'community_realestate.community_id',
			'community_basic.community_name',
			'community_realestate.building_id',
			'community_building.building_name',
			'community_realestate.acreage',
			'community_realestate.room_name',
			'community_realestate.room_number',
			'cost_relation.realestate_id',
			'cost_relation.cost_id',
			'cost_name.cost_name',
			'cost_name.parent',
			'cost_name.price',
		] )->from( 'cost_relation' )
			->join( 'left join', 'community_realestate', 'cost_relation.realestate_id = community_realestate.realestate_id' )
			->join( 'left join', 'community_building', 'community_building.building_id = community_realestate.building_id' )
			->join( 'left join', 'community_basic', 'community_basic.community_id = community_realestate.community_id' )
			->join( 'left join', 'cost_name', 'cost_relation.cost_id = cost_name.cost_id' )
			->andwhere( [ 'community_realestate.community_id' => $_SESSION[ 'user' ][ 'community' ] ] )
			->andwhere(['or not like','cost_name.cost_name',['水费']])
		    ->limit( 20 )
		    ->all();