backend/views/layouts/header.php

			->all();

		//获取小区名称
    	$c_name = CommunityBasic::find()
    	   ->select('community_id, community_name')
    	   ->asArray()
    	   ->all();
		//获取楼宇
    	$b_name = CommunityBuilding::find()
    		->select('building_id, building_name')
    		->asArray()
    		->all();
---
SELECT `community_id`, `community_name` FROM `community_basic`
SELECT `building_id`, `building_name` FROM `community_building`

			->all();

		//获取小区名称
    	$c_name = CommunityBasic::find()
    	    ->select('community_id, community_name')
    	    ->where(['community_id' => $a])
    	    ->asArray()
    	    ->all();
		//获取楼宇
    	$b_name = CommunityBuilding::find()
    		->select('building_name, building_id')
    		->where(['community_id' => $a])
    		->asArray()
    		->all();
		//计算当日注册量
		$query = (new \yii\db\Query())->select([
			    'user_data.reg_time',
			    'community_realestate.community_id'])
			->from ('user_data')
			->join('inner join','user_relationship_realestate','user_relationship_realestate.account_id = user_data.account_id')
			->join('inner join','community_realestate','community_realestate.realestate_id =user_relationship_realestate.realestate_id')
			->andwhere(['between', 'user_data.reg_time', strtotime(date('Y-m-d')),date(time())])
		    ->andwhere(['community_realestate.community_id' => $a]);
---
SELECT `community_id`, `community_name` FROM `community_basic` WHERE `community_id`=22
SELECT `building_name`, `building_id` FROM `community_building` WHERE `community_id`=22
SELECT COUNT(*) FROM `user_data` inner join `user_relationship_realestate` ON user_relationship_realestate.account_id = user_data.account_id inner join `community_realestate` ON community_realestate.realestate_id =user_relationship_realestate.realestate_id WHERE (`user_data`.`reg_time` BETWEEN 1522080000 AND '1522087671') AND (`community_realestate`.`community_id`=22)
SELECT `user_data`.`reg_time`, `community_realestate`.`community_id` FROM `user_data` inner join `user_relationship_realestate` ON user_relationship_realestate.account_id = user_data.account_id inner join `community_realestate` ON community_realestate.realestate_id =user_relationship_realestate.realestate_id WHERE (`user_data`.`reg_time` BETWEEN 1522080000 AND '1522087671') AND (`community_realestate`.`community_id`=22)