backend/views/layouts/header.php

    $build_id = array_unique(array_merge($o_b,$t_b)); //合并和去重复小区编号

    //获取楼宇
    $b_name = CommunityBuilding::find()
    	->select('building_name, building_id')
    	->where(['in', 'building_id', $build_id])
    	->asArray()
    	->all();
---
SELECT `building_name`, `building_id` FROM `community_building` WHERE `building_id`='49'