backend/views/news/index.php

SELECT `community_id`, `community_name` FROM `community_basic`
SELECT `community_id`, `community_name` FROM `community_basic` WHERE `community_id`=22
---
           function(data){
              $('.modal-body').html(data);
           }
        );
    });
JS;
$this->registerJs( $cJs );

Modal::end();

$this->title = '公告栏';
//$this->params['breadcrumbs'][] = $this->title;
?>
<div class="community-news-index">

    <?php
	$c = $_SESSION['community'];

		$comm = CommunityBasic::find()
			->select('community_name, community_id')
			->where(['in', 'community_id', $c])
			->orderBy('community_name DESC')
			->indexBy('community_id')
			->column();

	$gridview =[
            ['class' => 'kartik\grid\SerialColumn',
			'header' => '序<br />号'],

            ['attribute'=> 'community_id',
			 'value' => 'c.community_name',
			 'filterType' => GridView::FILTER_SELECT2,
			 //'filter' => CommunityBasic::find()->select(['community_name'])->orderBy('community_name')->indexBy('community_id')->column() ,
			 'filter' => $comm,//CommunityBasic::find()->select( [ 'community_name' ] )->orderBy( 'community_name' )->indexBy( 'community_name' )->column(),
			 'filterInputOptions' => [ 'placeholder' => '请选择' ],
			'filterWidgetOptions' => [
				'pluginOptions' => [ 'allowClear' => true ],
			],
			//'hAlign' => 'center',
			'width' => '150px'],

            ['attribute'=> 'title',
			 'value' => 'B',
			'hAlign' => 'left',
			'width' => 'px'],
