backend/views/cost-name/_form.php

	   $Array1 = Yii::$app->db->createCommand('select cost_id, cost_name from cost_name where level =0')->queryAll();
	   $comm = ArrayHelper::map($Array1,'cost_name','cost_name');

	   $cost_name = CostName::find()->select('cost_name,cost_id')->where(['level' => 0])->asArray()->all();
---
SELECT `cost_name`, `cost_id` FROM `cost_name` WHERE `level`=0