backend/views/cost-name/index.php

		//'cost_id',
		['attribute' => 'cost_name',
		'filterType' => GridView::FILTER_SELECT2,
			'filter' => CostName::find()->select( [ 'cost_name' ] )->where( [ 'level' => '0' ] )->orderBy( 'cost_name' )->indexBy( 'cost_name' )->column(),
---
SELECT `cost_name`, `cost_name`.`cost_name` FROM `cost_name` WHERE `level`='0' ORDER BY `cost_name`