backend/views/user-invoice/index.php

SELECT `community_id`, `community_name` FROM `community_basic`
SELECT DISTINCT `building_name` FROM `community_building`
---
	<?php
	$c = $_SESSION['user']['community'];
	if(empty($c)){
		$community = CommunityBasic::find()
			->select('community_id, community_name')
			->asArray()
			->all();
		$building = CommunityBuilding::find()
			->select('building_name')
			->distinct()
			->asArray()
			->all();