backend/views/community-realestate/index.php

			//'value' => 'building0.building_name',
			'format' => 'raw',
			'value' => function ( $model ) {
				$building = CommunityBuilding::find()->select( 'building_name' )->where( [ 'building_id' => $model->building_id ] )->asArray()->one();
---
SELECT `building_name` FROM `community_building` WHERE `building_id`=11